# Напишите функцию для транспонирования матрицы
A = [[7, 8, 9], [4, 5, 6]]
def trasport_m(A: list):
    print([*zip(*A)])
trasport_m(A)





